Для запуска контейнера с бд в командной строке: docker compose up -d

Для установки зависимостей в командной строке: pip install -r requirements.txt

Для применения миграций к бд в командной строке: alembic upgrade head

Для создания пользователя: в скрипте src/tables/users установить желаемые значения
                           переменных name и password(или оставить заданные по умолчанию),
                           затем запустить скрипт src/tables/users.py. Пользователь создан.
                           Далее его данные можно использовать для
                           аутентификации

Для запуска сервиса: запустить скрипт src/main.py